
## Plan Result (infrastructure)

[CI link](https://github.com/nangashi/dcr/actions/runs/7360589698)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 13 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * aws_athena_workgroup.athena_search
  * aws_cloudtrail.cloudtrail_search
  * aws_glue_catalog_database.catalog_db
  * aws_glue_catalog_table.cloudtrail_logs
  * aws_iam_role.notification_chatbot
  * aws_s3_bucket.athena_query_output
  * aws_s3_bucket.cloudtrail_search
  * aws_s3_bucket_lifecycle_configuration.athena_query_output
  * aws_s3_bucket_lifecycle_configuration.cloudtrail_search
  * aws_s3_bucket_policy.athena_query_output
  * aws_s3_bucket_policy.cloudtrail_search
  * aws_s3_bucket_versioning.athena_query_output
  * aws_s3_bucket_versioning.cloudtrail_search
* Update
  * awscc_chatbot_slack_channel_configuration.notification_chatbot
* Delete
  * awscc_iam_role.notification_chatbot


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_athena_workgroup.athena_search will be created
  + resource "aws_athena_workgroup" "athena_search" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "AthenaSearch-prd"
      + state         = "ENABLED"
      + tags_all      = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }

      + configuration {
          + enforce_workgroup_configuration    = true
          + publish_cloudwatch_metrics_enabled = true
          + requester_pays_enabled             = false

          + result_configuration {
              + output_location = "s3://athena-query-output-384081048358-prd/"
            }
        }
    }

  # aws_cloudtrail.cloudtrail_search will be created
  + resource "aws_cloudtrail" "cloudtrail_search" {
      + arn                           = (known after apply)
      + enable_log_file_validation    = false
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = false
      + is_multi_region_trail         = false
      + is_organization_trail         = false
      + name                          = "CloudTrailForSearch-prd"
      + s3_bucket_name                = (known after apply)
      + tags_all                      = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
    }

  # aws_glue_catalog_database.catalog_db will be created
  + resource "aws_glue_catalog_database" "catalog_db" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "catalog_db"
      + tags_all     = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
    }

  # aws_glue_catalog_table.cloudtrail_logs will be created
  + resource "aws_glue_catalog_table" "cloudtrail_logs" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "catalog_db"
      + id            = (known after apply)
      + name          = "cloudtrail_logs"
      + parameters    = {
          + "EXTERNAL"                           = "true"
          + "projection.enabled"                 = "true"
          + "projection.timestamp.format"        = "yyyy/MM/dd"
          + "projection.timestamp.interval"      = "1"
          + "projection.timestamp.interval.unit" = "DAYS"
          + "projection.timestamp.range"         = "2021/01/01,NOW"
          + "projection.timestamp.type"          = "date"
          + "storage.location.template"          = "s3://cloudtrail-log-384081048358-prd/AWSLogs/384081048358/CloudTrail/ap-northeast-1/${timestamp}"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_keys {
          + name = "timestamp"
          + type = "string"
        }

      + storage_descriptor {
          + input_format  = "com.amazon.emr.cloudtrail.CloudTrailInputFormat"
          + location      = "s3://cloudtrail-log-384081048358-prd/AWSLogs/384081048358/CloudTrail/ap-northeast-1/"
          + output_format = "org.apache.hadoop.hive.ql.io.HiveIgnoreKeyTextOutputFormat"

          + columns {
              + name = "eventtime"
              + type = "string"
            }
          + columns {
              + name = "eventname"
              + type = "string"
            }
          + columns {
              + name = "eventsource"
              + type = "string"
            }
          + columns {
              + name = "awsregion"
              + type = "string"
            }
          + columns {
              + name = "sourceipaddress"
              + type = "string"
            }
          + columns {
              + name = "useragent"
              + type = "string"
            }
          + columns {
              + name = "errorcode"
              + type = "string"
            }
          + columns {
              + name = "errormessage"
              + type = "string"
            }
          + columns {
              + name = "useridentity"
              + type = "struct<type:string,principalid:string,arn:string,accountid:string,invokedby:string,accesskeyid:string,username:string,sessioncontext:struct<attributes:struct<mfaauthenticated:string,creationdate:string>,sessionIssuer:struct<type:string,principalId:string,arn:string,accountId:string,userName:string>>>"
            }
          + columns {
              + name = "requestparameters"
              + type = "string"
            }
          + columns {
              + name = "responseelements"
              + type = "string"
            }
          + columns {
              + name = "additionaleventdata"
              + type = "string"
            }
          + columns {
              + name = "resources"
              + type = "array<struct<arn:string,accountId:string,type:string>>"
            }

          + ser_de_info {
              + name                  = "CloudTrailSerde"
              + serialization_library = "com.amazon.emr.hive.serde.CloudTrailSerde"
            }
        }
    }

  # aws_iam_role.notification_chatbot will be created
  + resource "aws_iam_role" "notification_chatbot" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "chatbot.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ChatBotChannelRole-prd"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "SubscribeSnsTopic"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "sns:Subscribe",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:sns:ap-northeast-1:384081048358:SlackNotification-prd",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # aws_s3_bucket.athena_query_output will be created
  + resource "aws_s3_bucket" "athena_query_output" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "athena-query-output-384081048358-prd"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.cloudtrail_search will be created
  + resource "aws_s3_bucket" "cloudtrail_search" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "cloudtrail-log-384081048358-prd"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.athena_query_output will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "athena_query_output" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "cleaning"
          + status = "Enabled"

          + expiration {
              + days                         = 7
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 3
            }
        }
    }

  # aws_s3_bucket_lifecycle_configuration.cloudtrail_search will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "cloudtrail_search" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "cleaning"
          + status = "Enabled"

          + expiration {
              + days                         = 7
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 1
            }
        }
    }

  # aws_s3_bucket_policy.athena_query_output will be created
  + resource "aws_s3_bucket_policy" "athena_query_output" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_policy.cloudtrail_search will be created
  + resource "aws_s3_bucket_policy" "cloudtrail_search" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_versioning.athena_query_output will be created
  + resource "aws_s3_bucket_versioning" "athena_query_output" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_bucket_versioning.cloudtrail_search will be created
  + resource "aws_s3_bucket_versioning" "cloudtrail_search" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # awscc_chatbot_slack_channel_configuration.notification_chatbot will be updated in-place
  ~ resource "awscc_chatbot_slack_channel_configuration" "notification_chatbot" {
      ~ iam_role_arn       = "arn:aws:iam::384081048358:role/ChatBotChannelRole-prd" -> (known after apply)
        id                 = "arn:aws:chatbot::384081048358:chat-configuration/slack-channel/Chatbot-prd"
        # (8 unchanged attributes hidden)
    }

  # awscc_iam_role.notification_chatbot will be destroyed
  # (because awscc_iam_role.notification_chatbot is not in configuration)
  - resource "awscc_iam_role" "notification_chatbot" {
      - arn                         = "arn:aws:iam::384081048358:role/ChatBotChannelRole-prd" -> null
      - assume_role_policy_document = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "chatbot.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - id                          = "ChatBotChannelRole-prd" -> null
      - managed_policy_arns         = [
          - "arn:aws:iam::aws:policy/ReadOnlyAccess",
        ] -> null
      - max_session_duration        = 3600 -> null
      - path                        = "/" -> null
      - policies                    = [
          - {
              - policy_document = jsonencode(
                    {
                      - Statement = [
                          - {
                              - Action   = "sns:Subscribe"
                              - Effect   = "Allow"
                              - Resource = "arn:aws:sns:ap-northeast-1:384081048358:SlackNotification-prd"
                            },
                        ]
                      - Version   = "2012-10-17"
                    }
                ) -> null
              - policy_name     = "SubscribeSnsTopic" -> null
            },
        ] -> null
      - role_id                     = "AROAVS3IDWMTJNX53NLZL" -> null
      - role_name                   = "ChatBotChannelRole-prd" -> null
    }

Plan: 13 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":34,"Program":"tfcmt","SHA1":"46b819287d8397d83db731c42cb1877a9acebfe7","Target":"infrastructure","Vars":{},"WorkflowName":"Check Pull Requests"} -->